<!DOCTYPE html>
<html>
 <body>
  <p>
  Пусть исполняемая программа хранится в стороке <br>
   str:string[100]; <br>
   переменные a,b,c,d хранятся в массиве <br>
    arr:array[0..3];    
  </p>
  <p>
  Инициализируем переменные <br>
  str:=' a=2 b=3  '; 
  <br>
   Для обработки символов a,b,c,d в тексте программы (сторке srt[]), используется оператор Ord, который преобразует <br>
   букву в её числовой код из ascii-таблицы. <br>
   ascii-коды символов, соответствующих буквам a,b,c,d лежат в диапазоне от 97 до 100 
   <pre>
  var
  test_char:char;
  begin
    test_char:='a';
    writeln(Ord(test_char));
  end.
   </pre>   
   код программы здесь 
   https://github.com/demsp/pas/blob/master/abcd/Ord.pas  
   <br>
   Для посимвольного перебора строки используется цикл while. <br>
   Программа по ссылке выводит на экран символы a,b <br>
   https://github.com/demsp/pas/blob/master/abcd/workpiece-billet.pas 
   <br>
   Пускай ascii-коды символов соответствующих переменных, получаемые в результате посимвольного перебора строки str[] <br>
   загружаются в аккумулятор var_acc <br>
   var_acc:=Ord(str[i]); <br>
  </p>
  <p>
  ascii-коды символов, соответствующих числам, лежат в диапазоне от 48 до 58 <br>
  Пускай цифра, полученная в результате посимвольного перебора строки, загружается в переменную, ascii-код которой <br>
  хранится в переменной var_acc <br>
  if Ord(str[i])>=48 then if Ord(str[i])<=58 then arr[var_acc-97]:=Ord(str[i])-48;<br> 
  https://github.com/demsp/pas/blob/master/abcd/load_digit_to_arr.pas 
  </p>
  <p>
  Для передачи данных из одной переменной в другую добавим оператор точка-с-запятой <br>
  Флаг сбрасывается при обработке данного символа <br> 
  if str[i]=';' then flag:=false <br>
  https://github.com/demsp/pas/blob/master/abcd/digit_letter_acc_arr.pas 
  </p>
 
 <p>
 Для разбора арифметического выражения, содержащего + добавим аккумулятор acc для хранения полученной суммы 
  
 Если при разборе строки попалось числовое значение, то оно прибавляется к аккумулятору <br>
 acc:=acc+(Ord(str[i])-48); <br>
 Если встретилось имя переменой, то к acc прибавляется значение, содержащиеся в этой переменной <br>
 acc:=acc+arr[Ord(str[i])-97];<br>
 https://github.com/demsp/pas/blob/master/abcd/plus_expression.pas
 </p>
 <p>
 Пускай цикл обрабатывается внутри квадратных скобок <br>
 Пускай переменная, предваряющая скобки, задаёт количество итераций <br>
 Добавим аккумулятор number_of_iterations для хранения числа, хранящегося в аккумуляторе var_acc и аккумулятор index_acc<br>
 для индексной переменной i <br>
 Если в тексте программы встретилась открывающая скобка [ то запоминаем её положение в индексной переменной, <br>
 а переменнцю var_acc загружаем в number_of_iterations, сбрасываем флаг
 <pre>
 if str[i]='[' then
 begin
   index_acc := i;
   number_of_iterations := var_acc;
   flag := false;
 end;  
 </pre> 
 Если в тексте программы встретилась закрывающая скобка ] и если переменная number_of_iterations <br>
 больще нуля, то декркментируем переменную number_of_iterations и переходим к открывающей скобке
 <pre>
 if str[i]=']' then
 begin
   arr[number_of_iteration-97] := arr[number_of_iteration-97]-1; 
   i := index_acc;
 end;  
 </pre>
 Если в тексте программы встретилась обратная кавычка, переходим к следующему символу в строке str[]<br>
 и выводим на экран требуемый элемент массива arr[] <br>
 https://github.com/demsp/pas/blob/master/abcd/iterations.pas
 /p>
 <p>
 </p>
  <p>
  Для разбора выражения, содержащего '+','-','*','/',  добавим добавим арифетический опрератор arithmetic_operator<br>
  и аккумулятор для арифметического оператора operator_acc<br>
  Пускай арифетическое выражение может содержать лишь четыре арифетических опретора <br>
  <pre>
  <Expr> ::= <Number> {<Operation> <Number>}
  <Operation> ::= '+' | '-' | '*' | '/'
  </pre>
  При разборе выражения необходимо учитывать приоритет операторов. 
  </p>
 </body> 
</html>  
