<!DOCTYPE html>
<html>
 <body>
  <p>
  Пусть исполняемая программа хранится в стороке <br>
   str:string[100]; <br>
   переменные a,b,c,d хранятся в массиве <br>
    arr:array[0..3];    
  </p>
  <p>
  Инициализируем переменные <br>
  str:=' a=2 b=3  '; 
  <br>
   Для обработки символов a,b,c,d в тексте программы (сторке srt[]), используется оператор Ord, который преобразует <br>
   букву в её числовой код из ascii-таблицы. <br>
   ascii-коды символов, соответствующих буквам a,b,c,d лежат в диапазоне от 97 до 100 
   <pre>
  var
  test_char:char;
  begin
    test_char:='a';
    writeln(Ord(test_char));
  end.
   </pre>   
   код программы здесь 
   https://github.com/demsp/pas/blob/master/abcd/Ord.pas  
   <br>
   Для посимвольного перебора строки используется цикл while. <br>
   Программа по ссылке выводит на экран символы a,b <br>
   https://github.com/demsp/pas/blob/master/abcd/workpiece-billet.pas 
   <br>
   Пускай ascii-коды символов соответствующих переменных, получаемые в результате посимвольного перебора строки str[] <br>
   загружаются в аккумулятор var_acc <br>
   var_acc:=Ord(str[i]); <br>
  </p>
  <p>
  ascii-коды символов, соответствующих числам, лежат в диапазоне от 48 до 58 <br>
  Пускай цифра, полученная в результате посимвольного перебора строки, загружается в переменную, ascii-код которой хранится в переменной var_acc <br>
  if Ord(str[i])>=48 then if Ord(str[i])<=58 then arr[var_acc-97]:=Ord(str[i])-48;<br> 
  https://github.com/demsp/pas/blob/master/abcd/load_digit_to_arr.pas 
  </p>
  <p>
  Для обмена даными между переменными необходим оператор, который сбрасывает флаг <br>
  Пусть флаг сбрасывается при обработке символа ;<br> 
  if str[i]=';' then flag:=false <br>
  https://github.com/demsp/pas/blob/master/abcd/digit_letter_acc_arr.pas 
  </p>
 
 <p>
 При разбора арифметического выражения, содержащего + используется аккумулятор acc для хранения полученной суммы. 
  
 Если при разборе строки попалось числовое значение, то оно прибавляется к аккумулятору <br>
 acc:=acc+(Ord(str[i])-48); <br>
 Если встретилось имя переменой, то к acc прибавляется значение, содержащиеся в этой переменной <br>
 acc:=acc+arr[Ord(str[i])-97];<br>
 https://github.com/demsp/pas/blob/master/abcd/plus_expression.pas
 </p>
 <p>
 Пусть цикл обрабатывается внутри квадратных скобок. <br>
 Пусть переменная, предваряющая скобки, задаёт количество итераций. <br>
 Аккумулятор number_of_iterations служит для хранения числа, содержащегося в аккумуляторе var_acc <br>
 аккумулятор index_acc нужен для индексной переменной i <br>
 Если в тексте программы встретилась открывающая скобка [ то её положение сохраняется в индексной переменной, 
 а переменная var_acc загружается в number_of_iterations; сбрасывается флаг
 <pre>
 if str[i]='[' then
 begin
   index_acc := i;
   number_of_iterations := var_acc;
   flag := false;
 end;  
 </pre> 
 Если в тексте программы встретилась закрывающая скобка ] и если переменная number_of_iterations <br>
 больше нуля, переменная number_of_iterations декрементируется и происходит переход к открывающей скобке
 <pre>
 if str[i]=']' then
 begin
   arr[number_of_iteration-97] := arr[number_of_iteration-97]-1; 
   i := index_acc;
 end;  
 </pre>
 Если в тексте программы встретилась обратная кавычка, происходит переход к следующему символу в строке str[]<br>
 и выводится на экран требуемый элемент массива arr[] <br>
 https://github.com/demsp/pas/blob/master/abcd/iterations.pas <br>
 Пусть переменные a и b хранят соседние числа Фибонначи, в переменной свычисляется сумма этих чисел, 
 а переменная d выступает в качестве счетчика итераций. Тогда программа, выводящая на экран ряд Фибоначчи
 выглядит так: str:= ' a=1; b=1; d=9; [ c=a+b; a=b; b=c; 'b ] ';
 </p>
 
  <p>
  Для разбора арифметического выражения добавим добавим арифетический опрератор arithmetic_operator<br>
  и аккумулятор для арифметического оператора operator_acc<br>
  Пускай арифетическое выражение может содержать лишь четыре арифетических опретора <br>
  
  &lt;Expr&gt; ::= &lt;Number&gt; {&lt;Operation&gt; &lt;Number&gt;} <br>
  &lt;Operation&gt; ::= '+' | '-' | '*' | '/' <br>
  Фигурные скобки (скобки Клини) обозначают, что к числу рекурсивно присоединяется пара: оператор и число <br>
  и таким образом к.п.г. реализуется цепочка, состоящая из разделённых операторами чисел. <br>  
  Если все операторы имеют одинаковый приоритет, то вычисление результата можно выполнить непосредственно в процессе разбора арифетического выражения,
  но в данном случае приоритет операторов * и / выше приретета + и - <br>
  Пускай операторы с низким приоритетом и относящиеся к ним операны заносятся в массивы operand_arr и operator_arr, а для операторов с высоким приоритетом результат вычисляется сразу 
  непосредственно в процессе разбора, а затем заносится в массив operand_arr. При появлении символа ; перебираются массивы operand_arr и operator_arr.     

  </p>
 </body> 
</html>  
